MyHome/src/Enums/ВидыДвиженийДенежныхСредств/ВидыДвиженийДенежныхСредств.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДвиженийДенежныхСредств</name>
  <enumValues>
    <name>Доход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
  <enumValues>
    <name>Перемещение</name>
  </enumValues>
</mdclass:Enum>

MyHome/src/CommonModules/СобытияФорм/Module.bsl
Процедура ПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт


КонецПроцедуры

Процедура ЗаполнитьКэшированныеЗначенияДляСвязиТиповДоходовРасходов(Форма) Экспорт
	
	КэшированныеЗначения = Форма.КэшированныеЗначения;
	
	Если КэшированныеЗначения = Неопределено Тогда
		КэшированныеЗначения = Новый Структура;
	КонецЕсли;
	
	КэшированныеЗначения.Вставить("ВидДвиженияДоход", ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.Доход"));
	КэшированныеЗначения.Вставить("ВидДвиженияРасход", ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.Расход"));
	КэшированныеЗначения.Вставить("ВидДвиженияПеремещение", ПредопределенноеЗначение("Перечисление.ВидыДвиженийДенежныхСредств.Перемещение"));
	
	МассивТиповСтатейЗатрат = Новый Массив;
	МассивТиповСтатейЗатрат.Добавить(Тип("Строка"));
	МассивТиповСтатейЗатрат.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиДоходов"));
	МассивТиповСтатейЗатрат.Добавить(Тип("ПланВидовХарактеристикСсылка.СтатьиРасходов"));
	
	МассивТиповДоходы = Новый Массив;
	МассивТиповДоходы.Добавить(МассивТиповСтатейЗатрат[1]);
	
	МассивТиповРасходы = Новый Массив;
	МассивТиповРасходы.Добавить(МассивТиповСтатейЗатрат[2]);
	
	КэшированныеЗначения.Вставить("ОграничениеТипаДоход", Новый ОписаниеТипов(МассивТиповДоходы));
	КэшированныеЗначения.Вставить("ОграничениеТипаРасход", Новый ОписаниеТипов(МассивТиповРасходы));
	КэшированныеЗначения.Вставить("ОграничениеТипаСтатьиЗатрат", Новый ОписаниеТипов(МассивТиповСтатейЗатрат));	
	
	Форма.КэшированныеЗначения = КэшированныеЗначения;
	
КонецПроцедуры
